Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་སོ།
en: Just like liberation are the thirty-seven factors conducive to enlightenment.

source: །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་འཕགས་པའི་བདེན་པ་རྣམས་དང་།
en: Just like liberation are the truths of the noble ones.

source: བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སོ།
en: Just like liberation are the meditative concentrations, the immeasurable attitudes, and the formless absorptions.

source: །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་།
en: Just like liberation are the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers.

source: མངོན་པར་ཤེས་པ་རྣམས་སོ། །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་སོ།
en: Just like liberation are the meditative stabilities and the dhāraṇī gateways.

source: །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དོ།
en: Just like liberation are the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas.

source: །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའོ།
en: Just like liberation is seeing the wisdom of liberation.

source: །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོའོ།
en: Just like liberation is the aggregate of seeing the wisdom of liberation.

source: །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་མོས་པའོ།
en: Just like liberation is resolution.

source: །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་རྗེས་སུ་ཡི་རང་བའོ།
en: Just like liberation is rejoicing.

source: །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་ཆོས་རྣམས་སོ།
en: Just like liberation are the Dharmas of the past, future, and present.

source: །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གོ།
en: Just like liberation are those lord buddhas.

source: །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའོ།
en: Just like liberation is the final nirvāṇa of those lord buddhas.

source: །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཉན་ཐོས་རྣམས་དང་། ཉན་ཐོས་དེ་དག་གི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའོ།
en: Just like liberation are the śrāvakas of those lord buddhas and the final nirvāṇa of those śrāvakas.

source: །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་རང་སངས་རྒྱས་རྣམས་དང་། རང་སངས་རྒྱས་དེ་དག་གི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའོ།
en: Just like liberation are the pratyekabuddhas and the final nirvāṇa of those pratyekabuddhas.

source: །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཆོས་ཉིད་དོ།
en: Just like liberation is the reality of those lord buddhas.

source: །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དེ་དག་གི་ཆོས་ཉིད་དོ།
en: Just like liberation is the reality of those śrāvakas and pratyekabuddhas.

source: །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་དོ་ཞེས། དེ་ལྟར་ཆོས་མ་ཆགས་པ་དང་། མ་བཅིངས་པ་དང་། མ་གྲོལ་བ་དང་།
en: Just like liberation is the reality of all phenomena!’ “

source: མ་ཞེན་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་རྣམ་པར་བྱང་བ་མེད་པ་རྣམས་ཀྱི་ཆོས་ཉིད་དང་། ཆོས་མ་སྐྱེས་པ་དང་ཡོངས་སུ་མ་སྐྱེས་པ་དང་། མ་བྱུང་བ་དང་མ་འགགས་པའི་ཆོས་ཉིད་ཇི་ལྟ་བ་དེ་བཞིན་དུ་འཕོ་བ་མེད་པ་དང་། འཇིག་པ་མེད་པ་ཉེ་བར་བཟུང་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་སྟེ།
en: So it is that on the basis of the reality of phenomena that are without attachment, without bondage, without liberation, without fixation, and without afflictive mental states, and the reality in which phenomena are nonarising, uncreated, unoriginated, and unceasing, the dedication should be made to unsurpassed, complete enlightenment, because there is no change and there is no decay. “

source: རབ་འབྱོར་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་རྗེས་སུ་ཡི་རང་བའི་རབ་བོ།
en: Subhūti, this is the best of the rejoicing of bodhisattva great beings.

source: །རྗེས་སུ་ཡི་རང་བའི་མི་མཉམ་པ་དང་མཉམ་པའི་བར་རོ།
en: This is the rejoicing that is equal to the unequaled, [and so forth].

source: །རབ་འབྱོར་རྗེས་སུ་ཡི་རང་བ་དེ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །རབ་འབྱོར་གཞན་ཡང་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་གང་ཇི་སྙེད་ཅིག་བཞུགས་པ་དང་། འཚོ་སྐྱོང་ཞིང་ཆོས་སྟོན་པ་དང་། ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་གང་ཇི་སྙེད་ཅིག་བཞུགས་པ་དང་། འཚོ་སྐྱོང་ཞིང་ཆོས་སྟོན་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་དེ་དག་ལ། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས། ནམ་འཚོའི་བར་དུ་ན་བཟའ་དང་། བསོད་སྙོམས་དང་། གཟིམས་ཆ་དང་། སྙུན་གྱི་རྐྱེན་རྩི་དང་། ཡོ་བྱད་མང་པོ་དང་། བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་རིམ་གྲོར་བྱས། བཀུར་སྟིར་བྱས།
en: Subhūti, bodhisattva great beings who possess this rejoicing will swiftly attain consummate buddhahood in unsurpassed, complete enlightenment. {

source: བསྟི་སྟང་དུ་བྱས། མཆོད་པར་བྱས་པ་དང་།
en: Ki.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་། དེ་དག་གི་རིང་བསྲེལ་ལ་ཉིན་མཚན་དུ་མེ་ཏོག་དང་ཕྲེང་བ་དང་སྤོས་དང་བྱུག་པ་དང་ཕྱེ་མ་དང་ན་བཟའ་དང་གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་མང་པོས་རིམ་གྲོར་བྱ་བ་དང་བཀུར་སྟིར་བྱ་བ་དང་བསྟི་སྟང་དུ་བྱ་བ་དང་། མཆོད་པར་བྱ་བའི་དོན་དུ་ཉམས་སུ་ལེན་ཅིང་། དེ་དམིགས་པའི་ཚུལ་གྱིས། ཚུལ་ཁྲིམས་སྲུང་བ་དང་། དེ་དམིགས་པའི་ཚུལ་གྱིས་བཟོད་པ་བསྒོམ་པ་དང་། དེ་དམིགས་པའི་ཚུལ་གྱིས་བརྩོན་འགྲུས་རྩོམ་པ་དང་། དེ་དམིགས་པའི་ཚུལ་གྱིས་བསམ་གཏན་ལ་སྙོམས་པར་འཇུག་པ་དང་།
en: II-III: 142} “Moreover, Subhūti, suppose any noble sons or noble daughters following the vehicle of the bodhisattvas should serve, respect, honor, and worship with food, alms, bedding, medicines for the treatment of disease, many resources, and many comforts the tathāgatas, arhats, completely awakened buddhas and their saṅghas of śrāvakas—that is to say, the lord buddhas and their communities of śrāvakas, as many as are alive at present, teaching the Dharma in the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, and the lord buddhas and their communities of śrāvakas, as many as are alive at present, teaching the Dharma in the world systems of each of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā—and suppose, even after those lord buddhas had passed into final nirvāṇa, they were to engage in experiential cultivation in order to serve, respect, honor, and worship their pearl relics, day and night, with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, and many ribbons, and suppose they were to maintain ethical discipline by way of apprehending, cultivate tolerance by way of apprehending, undertake perseverance by way of apprehending, be absorbed in meditative concentration by way of apprehending, and cultivate wisdom by way of apprehending.

source: དེ་དམིགས་པའི་ཚུལ་གྱིས་ཤེས་རབ་སྒོམ་པ་བས། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་གང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་དམིགས་པའི་ཚུལ་གྱིས་སྤྱོད་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་དམིགས་པའི་ཚུལ་གྱིས་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པས་དགེ་བའི་རྩ་བ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་ན། བསོད་ནམས་མངོན་པར་འདུ་བྱ་བ་དང་། དགེ་བ་མངོན་པར་འདུ་བྱ་བ་འདི་ལ་ནི། བསོད་ནམས་མངོན་པར་འདུ་བྱ་བ་སྔ་མས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ། རྒྱུའི་བར་དུ་ཡང་མི་བཟོད་དེ།
en: In contrast to them, when noble sons or noble daughters who have entered into unsurpassed, complete enlightenment practice the perfection of generosity without apprehending anything, and practice the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom without apprehending anything, if they dedicate those roots of virtuous action to unsurpassed, complete enlightenment with skill in means, then the accumulated merit of the former will not even come close to matching a hundredth part of their accumulated merit and accumulated virtue; nor will it match it in any quality [and so forth].

source: ཡོངས་སུ་བསྔོ་བ་དེ་ཉིད་རབ་ཅེས་བྱའོ། །གོང་ན་མེད་པའི་བར་ཞེས་བྱའོ། །རབ་འབྱོར་དེ་ལྟར་མི་དམིགས་པའི་ཚུལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: This dedication is said to be the best, it is said to be the highest, [and so forth]. “

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པས་དགེ་བའི་རྩ་བ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བྱའོ།
en: Subhūti, when bodhisattva great beings practice the perfection of generosity, and practice the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, without apprehending anything, they should dedicate those roots of virtuous action to unsurpassed, complete enlightenment, with skill in means.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ཡོངས་སུ་བསྔོ་བའི་ལེའུ་སྟེ་ཉི་ཤུ་བཞི་པའོ།། །།
en: This completes the twenty-fourth chapter, “Dedication,” from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤར་དྭ་ཏིའི་བུས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཤིན་དུ་རྣམ་པར་དག་པའི་སླད་དུ་སྣང་བར་བགྱིད་པའོ།
en: Chapter 25 Then the venerable Śāradvatīputra said to the Blessed One, “Blessed Lord, the perfection of wisdom sheds light owing to its utter purity.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཕྱག་བགྱི་བར་འོས་པའོ།
en: Venerable Lord, the perfection of wisdom is worthy of homage.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བདག་ཕྱག་འཚལ་ལོ།
en: Blessed Lord, I pay homage to the perfection of wisdom.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཁམས་གསུམ་པ་ཐམས་ཅད་ཀྱིས་མ་གོས་པའོ།
en: Blessed Lord, the perfection of wisdom is unsullied by all the three realms.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཉོན་མོངས་པ་དང་ལྟ་བའི་མུན་པ་ཐམས་ཅད་བསྩལ་པ་ལ་རབ་རིབ་མ་མཆིས་པར་བགྱིད་པའོ།
en: Blessed Lord, the perfection of wisdom dispels all the blindness of afflicted mental states and false views, rendering obfuscation nonexistent.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱི་ནང་ན་མཆོག་ཏུ་བགྱིད་པའོ།
en: Blessed Lord, the perfection of wisdom is supreme among the factors conducive to enlightenment.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་འཇིགས་པ་དང་། གནོད་པ་དང་། འཚེ་བ་ཐམས་ཅད་རབ་ཏུ་བྱང་བའི་སླད་དུ་བདེ་བར་བགྱིད་པའོ།
en: Blessed Lord, the perfection of wisdom secures happiness so that all fears, enmity, and harmful [thoughts or deeds] may be purified.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མིག་ལྔ་ཡོངས་སུ་ཐོབ་པར་བགྱིད་པ་ལ་སྣང་བར་བགྱིད་པའོ།
en: Blessed Lord, the perfection of wisdom brings light to all beings so that they might acquire the five eyes.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་སེམས་ཅན་ཤུལ་གོལ་བར་ཞུགས་པ་རྣམས་ཀྱི་མཐའ་ལས་ཟློག་པའི་སླད་དུ་ཤུལ་སྟོན་པའོ།
en: Blessed Lord, the perfection of wisdom teaches the path to those who are going astray so that they might reverse the [two] extremes.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤང་བ་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་བགྱིད་པའོ།
en: Blessed Lord, the perfection of wisdom establishes all-aspect omniscience, so that all afflicted mental states that bring about reincarnation through the continuity of propensities might be abandoned.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་སྐྱེད་པ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་མའོ།
en: Blessed Lord, the perfection of wisdom is the mother of bodhisattva great beings, {Ki.II-III: 143} generating the attributes of the buddhas.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་ཀྱི་སླད་དུ་མ་སྐྱེས་མ་འགགས་པའོ།
en: Blessed Lord, the perfection of wisdom neither arises nor ceases owing to the emptiness of intrinsic defining characteristics.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་མི་རྟག་མི་འཇིག་པའི་སླད་དུ་འཁོར་བའི་གཉེན་པོའོ།
en: Blessed Lord, the perfection of wisdom is the antidote for cyclic existence because it is neither permanent, nor is it perishable.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཆོས་རིན་པོ་ཆེ་ཐམས་ཅད་སྟོབས་པའི་སླད་དུ། སེམས་ཅན་མགོན་མ་མཆིས་པ་རྣམས་ཀྱི་མགོན་བགྱིད་པའོ།
en: Blessed Lord, the perfection of wisdom offers protection to beings who lack protection because it bestows the entirety of the precious doctrine.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཐུབ་པ་མ་མཆིས་པའི་སླད་དུ་སྟོབས་བཅུ་བགྱིད་པའོ།
en: Blessed Lord, the perfection of wisdom confers the ten powers because it cannot be crushed.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་འགྲོ་བ་དང་ལྡོག་པ་མ་མཆིས་པའི་སླད་དུ། རྣམ་པ་བཅུ་གཉིས་རྒྱུད་གསུམ་དུ་འཁོར་བའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའོ།
en: Blessed Lord, the perfection of wisdom turns the wheel of the Dharma, repeating it three times and in twelve ways, because it is subject to neither promulgation nor reversal.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་སླད་དུ་ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་སྟོན་པའོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་པའམ།
en: Blessed Lord, the perfection of wisdom displays the essential nature of all phenomena owing to the emptiness of the essential nature of nonentities.

source: ཉན་ཐོས་སམ། ཉན་ཐོས་ཀྱི་ཐེག་པ་པའམ། རང་སངས་རྒྱས་སམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པས། ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པར་བགྱི།
en: Blessed Lord, how can bodhisattvas or those in the vehicle of the bodhisattvas, śrāvakas or those in the vehicle of the śrāvakas, pratyekabuddhas or those in the vehicle of the pratyekabuddhas dwell in the perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤར་དྭ་ཏིའི་བུ་སྟོན་པ་ལ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པར་བྱའོ།
en: Śāradvatīputra,” replied the Blessed One, “they should dwell in the perfection of wisdom, just as they dwell alongside the Teacher.

source: །སྟོན་པ་ལ་ཇི་ལྟར་ཕྱག་བྱ་བ་དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཕྱག་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: They should pay homage to the perfection of wisdom, just as they pay homage to the Teacher.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་སྟོན་པ་ཡིན་ཏེ།
en: If you ask why, this perfection of wisdom is itself the Teacher.

source: སྟོན་པ་ཡང་གཞན་མ་ཡིན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་གཞན་མ་ཡིན།
en: The Teacher is not one distinct thing, and the perfection of wisdom another.

source: སྟོན་པ་ཉིད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཉིད་ཀྱང་སྟོན་པའོ།
en: Rather, the Teacher himself is indeed the perfection of wisdom and the nature of the perfection of wisdom is indeed the Teacher.

source: །དེའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་འབྱུང་ངོ་། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། རང་སངས་རྒྱས་དང་། དགྲ་བཅོམ་པ་དང་། ཕྱིར་མི་འོང་བ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། རྒྱུན་ཏུ་ཞུགས་པ་རྣམས་འབྱུང་ངོ་།
en: This is why the tathāgatas, arhats, completely awakened buddhas emerge from the perfection of wisdom, as do bodhisattva great beings, pratyekabuddhas, arhats, those who are no longer subject to rebirth, those who are destined for only one more rebirth, and those who have entered the stream to nirvāṇa.

source: །དེའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་འབྱུང་ངོ་། །བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་བར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་འབྱུང་ངོ་།
en: This is why the paths of the ten virtuous actions emerges from the perfection of wisdom, as do the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the five extrasensory powers, the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, the perfection of wisdom, the emptiness of internal phenomena, the emptiness of external phenomena, the emptiness of external and internal phenomena, the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the thirty-seven factors conducive to enlightenment, the four truths of the noble ones, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, the eighteen distinct qualities of the buddhas, knowledge of all the dharmas, knowledge of the path, and all-aspect omniscience.”

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་འདི་སྙམ་དུ་གྱུར་ཏེ། བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཞུ་བ་འདི་ནི་གང་ལས་སྐྱེས། ཅིའི་རྒྱུ་སྙམ་པ་དང་། དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀཽ་ཤི་ཀ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་བཟུང་བ་རྣམས་ནི་ཐབས་མཁས་པས།
en: Thereupon, Śakra, mighty lord of the gods, thought, “What is the basis of this question that the venerable Śāradvatīputra has asked?

source: འདས་པ་དང་།
en: What is the reason for it?”

source: མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཐུགས་དང་པོ་བསྐྱེད་པ་ནས། དམ་པའི་ཆོས་གནས་པའི་བར་གྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་དང་། རང་སངས་རྒྱས་དང་བཅས་པ་དེ་དག་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་དེ་དག་ཐམས་ཅད་གཅིག་ཏུ་བསྡུས་ཏེ།
en: The venerable Śāradvatīputra then said to Śakra, mighty lord of the gods, “Kauśika, bodhisattva great beings who have acquired the perfection of wisdom, owing to their skillful means, have gathered together all those roots of virtuous action possessed by the lord buddhas of the past, future, and present, commencing from the time when they first begin to set their mind on enlightenment and lasting as long as the Dharma itself endures, along with those [roots of virtuous action] of the community of śrāvakas, those of the pratyekabuddhas, and those of all beings, and they have then dedicated these to unsurpassed, complete enlightenment.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བ་ནས་བདག་གི་ཞུ་བ་སྐྱེས་སོ།
en: That is the basis of the question I asked. “

source: །ཀཽ་ཤི་ཀ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟིལ་གྱིས་གནོན་ཏོ།
en: Kauśika, this perfection of wisdom possessed by bodhisattva great beings outshines the perfection of generosity, {Ki.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟིལ་གྱིས་གནོན་ཏོ། ཀཽ་ཤི་ཀ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: II-III: 144} and it outshines the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, and the perfection of meditative concentration.

source: དམུས་ལོང་བརྒྱ་འམ། སྟོང་ངམ། བརྒྱ་ཕྲག་སྟོང་ཡང་རུང་སྟེ། དམིགས་བུ་མེད་པས་ལམ་དུ་འཇུག་པར་ཡང་མི་ནུས་ན། གྲོང་ཁྱེར་དུ་འགྲོ་བར་ལྟ་ག་ལ་ནུས།
en: Kauśika, just as if those who are born blind, whether they number a hundred, a thousand, or a hundred thousand, cannot set out on a road without a guide, how could they enter a city!

source: ཀཽ་ཤི་ཀ་དེ་བཞིན་དུ་ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་བོ་འདི་དག་ནི་དམུས་ལོང་ལྟ་བུར་གྱུར་པ་སྟེ།
en: In the same way, Kauśika, those five other perfections resemble one who is born blind.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་ན། དེ་དག་ལ་དམིགས་བུ་མེད་པས་བྱང་ཆུབ་ཀྱི་ལམ་ཡང་སྐྱེད་མི་ནུས་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གྲོང་ཁྱེར་དུ་འཇུག་པར་ལྟ་ག་ལ་ནུས།
en: If there is no perfection of wisdom, they will have no guide, so if they cannot even generate the path of enlightenment, how could they enter the citadel of all-aspect omniscience!

source: ཀཽ་ཤི་ཀ་ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་ནམ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་ཟིན་པར་གྱུར་པ་དེའི་ཚེ། མིག་དང་ལྡན་པར་འགྱུར་ཏེ། ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་བོ་འདི་དག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་བཟུང་ན།
en: However, Kauśika, when the five other perfections have been acquired through the perfection of wisdom, these five perfections will be endowed with vision.

source: ཕ་རོལ་དུ་ཕྱིན་པའི་མིང་འཐོབ་བོ།
en: Indeed, it is because they are acquired by means of the perfection of wisdom that they are designated as perfections.”

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུས་གང་འདི་སྐད་དུ། ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་པོ་འདི་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་བཟུང་ན། ཕ་རོལ་དུ་ཕྱིན་པའི་མིང་འཐོབ་བོ་ཞེས་སྨྲས་ན།
en: Then Śakra, mighty lord of the gods, inquired of the venerable Śāradvatīputra, “Venerable Śāradvatīputra, you say that these five perfections are designated as perfections inasmuch as they have been acquired by means of the perfection of wisdom.

source: བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་དེར་ཡང་མ་ཟད་དེ། ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་ནི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་བཟུང་ཡང་ཕ་རོལ་དུ་ཕྱིན་པའི་མིང་འཐོབ་བམ།
en: However, Venerable Śāradvatīputra, in addition to that, are these five perfections not designated as perfections because they are also acquired by means of the perfection of generosity?

source: ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་ནི་ཚུལ་ཁྲིམས་དང་བཟོད་པ་དང་བརྩོན་འགྲུས་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་བཟུང་ཡང་ཕ་རོལ་དུ་ཕྱིན་པའི་མིང་འཐོབ་བམ།
en: Similarly, are these five perfections not designated as perfections because they are also acquired by means of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, and the perfection of meditative concentration?” “

source: སྨྲས་པ་དེ་ལྟ་མ་ཡིན་ཏེ།
en: Kauśika,” he replied, “that is not so!

source: ཀཽ་ཤི་ཀ་དེ་ནི་དེ་ལྟ་མ་ཡིན་ནོ།
en: That is not so!

source: །ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་ནི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་བཟུང་བས།
en: These five perfections are not designated as perfections because they are acquired by means of the perfection of generosity.
